In [0]:
import pandas as pd

In [0]:
"""
Read data1.csv and data2.csv as df1 and df2 dataFrames objects respectively. Use
Pandas I/O libraries. Use column 0 as index for df1 and column 1 as index for df2.
Print df1 and df2
"""

df1 = pd.read_csv("/content/drive/My Drive/Semester 8/DSci/Lab/Lab2/data/data1.csv", index_col=0)
df2 = pd.read_csv("/content/drive/My Drive/Semester 8/DSci/Lab/Lab2/data/data2.csv", index_col=1)

display(df1)
display(df2)

   A    B  C
0  1  2.0  3
1  4  5.0  6
4  2  NaN  5

       A  B  C
2      2  5  6
3  Hello  3  4

In [0]:
"""
Modify (a) to concatenate df1 and df2 and assign it to df3. Print df3
"""
df3 = pd.concat([df1,df2])
df3.index.name = "index"
display(df3)

           A    B  C
index
0          1  2.0  3
1          4  5.0  6
4          2  NaN  5
2          2  5.0  6
3      Hello  3.0  4

In [0]:
"""
Read data3.csv as df4 dataframe object and print df4 (not shown below). There are
2 new column ‘D’ and ‘E’ in this file. Merge df4 with df3 so that new dataframe
(df5) has total 5 columns (A, B, C, D, E)
"""

df4 = pd.read_csv("/content/drive/My Drive/Semester 8/DSci/Lab/Lab2/data/data3.csv", index_col=0)
df4.index.name = "index"
display(df4)


df5= pd.merge(df3,df4, on="index", how="outer")
df5=df5.sort_index(axis=0)
display(df5)

       D  E
index
1      1  7
4      0  8

           A    B  C    D    E
index
0          1  2.0  3  NaN  NaN
1          4  5.0  6  1.0  7.0
2          2  5.0  6  NaN  NaN
3      Hello  3.0  4  NaN  NaN
4          2  NaN  5  0.0  8.0

In [0]:
"""
Read data.json as df6 and concatenate with df5. Use df7 as name of dataframe
"""

df6 = pd.read_json("/content/drive/My Drive/Semester 8/DSci/Lab/Lab2/data/data.json")
display(df6)
df7 = pd.concat([df5,df6], ignore_index=True)
df7

    A  B
0  11  9
1  22  7
2  33  8

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:7: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  import sys

       A    B    C    D    E
0      1  2.0  3.0  NaN  NaN
1      4  5.0  6.0  1.0  7.0
2      2  5.0  6.0  NaN  NaN
3  Hello  3.0  4.0  NaN  NaN
4      2  NaN  5.0  0.0  8.0
5     11  9.0  NaN  NaN  NaN
6     22  7.0  NaN  NaN  NaN
7     33  8.0  NaN  NaN  NaN

In [0]:
"""
Replace Hello with NaN. Make it as general as possible so that all strings in
dataframe df7 automatically becomes NaN
"""
from numpy import nan as NaN
df7= df7.replace("Hello", NaN)
df7.index.name= "index"
display(df7)

         A    B    C    D    E
index
0        1  2.0  3.0  NaN  NaN
1        4  5.0  6.0  1.0  7.0
2        2  5.0  6.0  NaN  NaN
3      NaN  3.0  4.0  NaN  NaN
4        2  NaN  5.0  0.0  8.0
5       11  9.0  NaN  NaN  NaN
6       22  7.0  NaN  NaN  NaN
7       33  8.0  NaN  NaN  NaN

In [0]:
"""
Replace NaN with mean values of the columns. Save the final dataframe as
“newdata.csv”
"""
df7["A"][2] = int(df7["A"][2])
df7.fillna(df7.mean(), inplace=True)
df7.to_csv("/content/drive/My Drive/Semester 8/DSci/Lab/Lab2/newdata.csv")

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """